app/controllers/bugs_controller.rb

SELECT "bugs".* FROM "bugs" ORDER BY created_at DESC
---
  def index
    @bugs = Bug.all

INSERT INTO "bugs" ("description_of_issue", "reproducible", "severity", "qa_team_member", "number_of_reports", "created_at", "updated_at", "bug_status", "transaction_id", "vehicle_id", "resolution", "website_url", "area_interface", "reporter_email", "customer", "user_id", "product_team_member") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    #@bug = Bug.new(bug_params)
    @bug = current_user.bugs.build(bug_params)
    respond_to do |format|
      if @bug.save

UPDATE "bugs" SET "updated_at" = $1, "product_team_member" = $2 WHERE "bugs"."id" = $3  [["updated_at", "2022-01-24 15:56:47.067721"], ["product_team_member", "Aris - Inspections"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @bug.update(bug_params)

DELETE FROM "bugs" WHERE "bugs"."id" = $1  [["id", 1]]
---
  def destroy
    @bug.destroy

SELECT "bugs".* FROM "bugs" WHERE "bugs"."user_id" = $1 AND "bugs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def correct_user
    @bug = current_user.bugs.find_by(id: params[ :id ])

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bug
      @bug = Bug.find(params[:id])